Examples/Lagrangian/functionObjects/hotStream/constant/injectFromLeftProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kinematicCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          yes;

InjectionModel  PatchInjection;

DragModel       SphereDrag;

DispersionModel none;

// PatchInteractionModel Rebound;
PatchInteractionModel StandardWallInteraction;

HeatTransferModel RanzMarshall;

PostProcessingModel PatchPostProcessing;

CompositionModel SinglePhaseMixture;

// PhaseChangeModel none;
PhaseChangeModel LiquidEvaporation;

coupled         true;

cellValueSourceCorrection on;

parcelTypeId    2;

radiation       off;

constantProperties
{
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 1e-15;
    minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;
    rho0            rho0 [ 1 -3 0 0 0 ] 5000;
    T0            T0 [ 0 0 0 1 0 ] 400;
    TMin            T0 [ 0 0 0 1 0 ] 300;
    cp0             cp0 [ 0 2 -2 -1 0 ] 900;
    epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;
    f0              f0 [ 0 0 0 0 0 ] 0.5;
    Pr              Pr [ 0 0 0 0 0 ] 0.7;

    pMin pMin [0 0 0 0 0 0 0] 1e4;
    constantVolume 1;
    Tvap T0 [ 0 0 0 1 0 ]  450;
    Tbp T0 [ 0 0 0 1 0 ]  370;
}

interpolationSchemes
{
    rhoPseudo             cell;
    U               cellPoint;
    mu              cell;
    T               cell;
    Cp              cell;
    p               cell;
}

integrationSchemes
{
    U               Euler;
    T               Analytical;
}

particleForces
{
    gravity         on;
    virtualMass     off;
    pressureGradient off;
}

ConeInjectionCoeffs
{
    massTotal       massTotal [ 1 0 0 0 0 ] 0.002;
    parcelBasisType mass;

    SOI             0.001;
    duration        0.5;
    position        ( 0.05 0.09 0.005 );
    direction       ( 0 -1 0 );
    parcelsPerSecond 10000;
    volumeFlowRate  constant 0.00001;
    Umag            constant 5e-1;
    thetaInner      constant 0;
    thetaOuter      constant 30;

    parcelPDF
    {
        pdfType         uniform;
        //        pdfType         RosinRammler;
        RosinRammlerPDF
        {
            minValue        5e-05;
            maxValue        0.001;
            d                7.5e-05;
            n                0.5 ;
        }
        uniformPDF
        {
            minValue 5e-5;
            maxValue 1e-3;
        }
    }
}

PatchInjectionCoeffs
{
    patchName left;
    U0              ( 1 0 0 );

    $ConeInjectionCoeffs;
}

StandardWallInteractionCoeffs
{
    type            rebound;
}

ReboundCoeffs
{
    UFactor 1;
}

PatchPostProcessingCoeffs
{
    maxStoredParcels 10000;
    patches ( right );
}

RanzMarshallCoeffs
{
    BirdCorrection  off;
}

SinglePhaseMixtureCoeffs
{
    phases
    (
        liquid
        {
            H2O 1;
            // H2O 0.8;
            //            N2 0.2;
        }
    );
}

LiquidEvaporationCoeffs
{
    //    enthalpyTransfer enthalpyDifference;
    enthalpyTransfer latentHeat;

    activeLiquids
    (
        H2O
    );
}

// ************************************************************************* //
